<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Zope und C.U.O.N. </title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
</head>

<body text="#000000" bgcolor="#ffffff">

<strong><font size="+4">Zope und C.U.O.N. </font></strong>
<br />
<p>Von <font size="+2"><strong><a href="mailto:jhamel@cyrus-computer.net">J&uuml;rgen Hamel</a></strong></font></p>
<table summary="" border="1" width="100%" bgcolor="#e6e6e6">
<tr><td>
<font size="+1"><strong><u>Inhalt</u></strong></font><br />
&nbsp;&nbsp;&nbsp;&nbsp;1. <a href="#ToC0">Einf&uuml;hrung</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;2. <a href="#ToC1">Authentifizierung</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;3. <a href="#ToC2">Zope als Applicationserver f&uuml;r CUON</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;4. <a href="#ToC3">Die Database-Anbindung</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;5. <a href="#ToC4">Das Webinterface</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;6. <a href="#ToC5">Der Webshop OsCommerce</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;7. <a href="#ToC6">Verbindung zum AI-Server</a><br />
&nbsp;&nbsp;&nbsp;&nbsp;8. <a href="#ToC7">Das Wichtigste </a><br />
</td></tr></table>
<p><font size="+2"><a name="ToC0"><strong>1. Einf&uuml;hrung</strong></a></font></p>
CUON ist ein kaufm&auml;nnisches Warenwirtschaftssystem, das im Serverbereich auf »Zope« aufbaut. Dabei nutzt es »Zope« in vielerlei Hinsicht:
<ul>
<li>Zur Authentifizierung</li>
<li>Als Applicationserver</li>
<li>Als Schnittstelle zur Datenbank</li>
<li>Als direktes Webinterface</li>
<li>Verbindung zu OsCommerce</li>

</ul>
Eine erste Einf&uuml;hrung sowie andere Information und der download des Programms finden Sie unter <a href="http://www.cuon.org">www.cuon.org</a>.

<p><font size="+2"><a name="ToC1"><strong>2. Authentifizierung</strong></a></font></p>
Ein besonderes Problem ist immer eine Userverwaltung und die Authentifizierung der User. Dies kann frau/mann nat&uuml;rlich selber programmieren, aber wenn das ganze &uuml;ber Internet m&ouml;glich sein soll, geh&ouml;rt schon eine ganze Menge Zeit dazu, um dies zu realisieren und zu warten. Hier bot es sich geradezu an, »Zope« zu benutzen. Die Systematik wurde ganz einfach realisiert: 
&Uuml;ber die »Zope«funktion »context.acl_users.authenticate« kann ich checken, ober der User und das Passwort o.k. sind, anschie&szlig;end vergebe ich eine SessionID, die eine bestimmte Zeit g&uuml;ltig ist. Alle nachfolgende Aufrufe werden mit dieser SessionID verbunden.
Dadurch wird die Userverwaltung auf »Zope« ausgelagert und bei gesteigerten Sicherheitsbed&uuml;rfnis kann dann nat&uuml;rlich statt http auch https benutzt werden. Au&szlig;erdem wird das Passwort nur einmal &uuml;bertragen, dies bringt zus&auml;tzliche Sicherheit.

<p><font size="+2"><a name="ToC2"><strong>3. »Zope« als Applicationserver f&uuml;r CUON</strong></a></font></p>
Ein besonderes Merkmal von »Zope« ist nat&uuml;rlich die M&ouml;glichkeit, ihn als Applicationserver zu benutzen. Dabei wird bei CUON xmlrpc benutzt. Das hat mehrere Vorteile:
<ul>
<li>xmlrpc hat nur geringen Overhead im Vergleich zu SOAP</li>
<li>Es ist in vielen Programmiersprachen vorhanden</li>
<li>Das &Uuml;bertragungsprotokoll ist sehr einfach</li>
</ul>
Dies war f&uuml;r mich ein dicker, dicker Pluspunkt f&uuml;r »Zope«, denn es sollte von vornherein die M&ouml;glichkeit von div. anderen Clients existieren. Denn ein Vorteil eines Applicationservers ist ja nun mal, das die Funktionalit&auml;t auf den Server ausgelagert ist und die Cliententwicklung sehr viel einfacher ist. Vielleicht ist es auch f&uuml;r einige von euch interessant, wenn Ihr mal ein Beispiel seht, wie leicht »Zope« als Applicationserver genutzt werden kann. Wenn Ihr diesen einfachen Code auf euren PC in der Datei sv.py abspeichert und mit python sv.py ausf&uuml;hrt, wird eine Verbindung zum Server hergestellt und ein String zur&uuml;ckgegeben.
<center>
<table summary="Listing" border="0" bgcolor="#000000" cellpadding="1" cellspacing="0"><tr><td>
<table summary="" border="0" bgcolor="#d6ebff" cellpadding="3" cellspacing="2"><tr><td>
<pre><small>
from xmlrpclib import ServerProxy
sv =  ServerProxy('http://84.244.7.139:9673//Cuon')
test = sv.src.XML.py_getCuon()
print test
</small></pre>
</td></tr></table>
</td></tr></table>
</center>
In anderen Sprachen ist es nur minimal komplexer und da in einer Warenwirtschaft es zu sehr heftigen Datentransfers kommen kann, braucht der Client-Rechner nicht so leistungsf&auml;hig sein. Selbst mit einen Handy w&auml;re es m&ouml;glich, einen Teil der Warenwirtschaft zu nutzen, z.B. eine Auswertung oder eine Adresse aufs Display zu zaubern.

<p><font size="+2"><a name="ToC3"><strong>4. Die Database-Anbindung</strong></a></font></p>
CUON arbeitet mit Postgres als SQL-Server zusammen, andere SQL-Server sind aber mit einigen kleinen &Auml;nderungen auch nutzbar. Die Datenbankanbindung ist aber eigentlich immer sehr schwierig. Mal hat die Programmiersprache (python, java, c++, basic,php, perl, ruby, etc.)  keinen passenden Datenbanktreiber oder aber es gibt f&uuml;r das OS keinen Treiber( Es gibt ja nicht nur LINUX MAC oder Windows, sondern auch FREEDOS, Plan9, IRIX, Darwin, reactOS und tausend andere ). Oder der Treiber hat unter den einen System einen anderen Funktionsumfang als auf den anderen, oder es ist ein unfreier SQL-Server, der nur ein System unterst&uuml;tzt. Ein leidiges Thema und dank »Zope« super einfach gel&ouml;st. Denn kein Client braucht irgendeine Art Treiber f&uuml;r die Datenbank. »Zope« baut eine Verbindung zur Datenbank auf, f&uuml;hrt die Auswertung durch, schreibt die Daten und sendet das Ergebnis dem Client. Das fand ich nach jahrelanger Qu&auml;lerei mit den Treibern einfach Spitzenklasse.
Die Technik ist auch ( fast spielerisch )  einfach :<p>
Im »Zope« Root-Folder gibt es f&uuml;r jeden User 2 Dateien:
<ul>
<li>1 Database-Connection ( in diesem Fall PSYCOPG )</li>
<li>1 ZSQL-Methode, deren einziger Inhalt so aussieht: <font color="#660000"><tt><font color="#007700"><strong>&lt;dtml-var cSql&gt;</strong></font></tt></font></li>
</ul>
Das war es schon ( wobei die Database-Connection auch f&uuml;r mehrere User genutzt werden kann ) !!

<p><font size="+2"><a name="ToC4"><strong>5. Das Webinterface</strong></a></font></p>
Zu den o.g. Punkten bietet »Zope« mit der kompletten Web-Umgebung aber noch ein hochinteressantes Feature. Damit lassen sich dann die Daten aus CUON als Internet-Daten aufbereiten und darstellen. Ich habe das schon mal angetestet, aber leider fehlte mir die Zeit, um mich da reinzuarbeiten. Trotzdem hier ein Beispiel:
Nach dem &uuml;blichen Aufbau einer Webseite kommt folgender Aufruf:<br />

<center>
<table summary="Listing" border="0" bgcolor="#000000" cellpadding="1" cellspacing="0"><tr><td>
<table summary="" border="0" bgcolor="#d6ebff" cellpadding="3" cellspacing="2"><tr><td>
<pre><small><font color="#007700"><strong>&lt;dtml-let dict="src.Address.py_getPhonelist1({},{'Name':_.SecurityGetUser().getUserName(), 'SessionID':src.Databases.py_getValue('webuser_' + _.SecurityGetUser().getUserName())['SessionID']})" &gt;</strong></font>
</small></pre>
</td></tr></table>
</td></tr></table>
</center>
Und schon stehen die Adressen zur Verf&uuml;gung. die Funktion »src.Address.py_getPhonelist1 « ist &uuml;brigens dieselbe Funktion, die mein Client aufruft. Dadurch wird viel Enwicklungszeit eingespart.
Die Darstellung folgt dann wieder  wie in »Zope« &uuml;blich:
<center>
<table summary="Listing" border="0" bgcolor="#000000" cellpadding="1" cellspacing="0"><tr><td>
<table summary="" border="0" bgcolor="#d6ebff" cellpadding="3" cellspacing="2"><tr><td>
<pre><small>
                                                                                                             
                                                                                                              
<font color="#007700"><strong>&lt;table align="left" cellpadding="2"&gt;</strong></font>
   <font color="#007700"><strong>&lt;tr bgcolor="#888EEE"&gt;</strong></font>
 
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Lastname&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Lastname2&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Firstname&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Street&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Zipcode2&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
        <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;City&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
       <font color="#007700"><strong>&lt;td&gt;</strong></font>&nbsp;Phone&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>

 <font color="#007700"><strong>&lt;/tr&gt;</strong></font>

                                                                                                              
<font color="#007700"><strong>&lt;dtml-in "dict" prefix=pc&gt;</strong></font>
  <font color="#007700"><strong>&lt;tr <font color="#007700"><strong>&lt;dtml-if sequence-odd>bgcolor="#EEEEEE"
            <font color="#007700"><strong>&lt;dtml-else&gt;</strong></font>bgcolor="#FFFFFF"
            <font color="#007700"><strong>&lt;/dtml-if&gt;</strong></font> &gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['lastname']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['lastname2']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['firstname']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['street']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['zip']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['city']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="left"&gt;</strong></font>  &nbsp;<font color="#007700"><strong>&lt;dtml-var "pc_item['phone']"&gt;</strong></font>&nbsp;<font color="#007700"><strong>&lt;/td&gt;</strong></font>
   <font color="#007700"><strong>&lt;td align="center"&gt;</strong></font> <font color="#007700"><strong>&lt;form action="partner_phonelist"&gt;</strong></font>
<font color="#007700"><strong>&lt;input type="submit" name="ID" value="Partner"&gt;</strong></font>
<font color="#007700"><strong>&lt;input type="hidden" name="Address_ID" value= <font color="#007700"><strong>&lt;dtml-var "pc_item['id']"&gt;</strong></font> &gt;</strong></font><font color="#007700"><strong>&lt;br&gt;</strong></font> 
<font color="#007700"><strong>&lt;/form&gt;</strong></font> <font color="#007700"><strong>&lt;/td&gt;</strong></font>
   
  

   <font color="#007700"><strong>&lt;/tr&gt;</strong></font>
<font color="#007700"><strong>&lt;/dtml-in&gt;</strong></font>
                                                                                                              
<font color="#007700"><strong>&lt;/table&gt;</strong></font>
 
</small></pre>
</td></tr></table>
</td></tr></table>
</center>

Meiner Meinung nach bieten sich hier in »Zope« noch Riesenm&ouml;glichkeiten f&uuml;r CUON.

<p><font size="+2"><a name="ToC5"><strong>6. Der Webshop OsCommerce</strong></a></font></p>
Der Verkauf &uuml;ber Internet ist heute f&uuml;r viele Firmen selbstverst&auml;ndlich. Bei meiner Suche stie&szlig; ich auch auf den Webshop OsCommerce, der zwar kein »Zope«-Produkt ist, aber trotzdem durch den Funktionsumfang &uuml;berzeugen konnte. Und ich bekam den Auftrag, &uuml;ber 20.000 Artikel aus einer Windows-Warenwirtschaft nach OsCommerce zu transformieren. Dadurch inspiriert, &uuml;berlegte ich mir, wie ich CUON und OsCommerce kombinieren konnte. Und auch hier half mir »Zope« schnell weiter. Eine Database-Connection mit den MySql-Datenbanken von OsCommerce und schon konnte ich die Artikel in Cuon importieren ( Der Import-Filter war ja schon fertig) und dann &uuml;ber eine Python-Funktion in verschiedenen MySql-Tabellen einf&uuml;gen. Dadurch ermutigt, habe ich f&uuml;r CUON eine Funktion geschrieben, die Kundenadressen im Webshop mit den Adressen in CUON abgleicht. Legt also ein Kunde im Webshop eine Adresse an oder &auml;ndert seine Adresse, wird dies auch in CUON aktualisiert. Zur Zeit (Feb. 2006) bin ich dabei, auch die Artikelpflege &uuml;ber CUON mit dem Webshop abzugleichen. Danach kommt noch die Auftragsverarbeitung dran und ein komplettes System f&uuml;r den Internethandel ist fertig.

<p><font size="+2"><a name="ToC6"><strong>7. Verbindung zum AI-Server</strong></a></font></p>
Seit Februar enwickle ich ein neues Modul. Auch hier spielt »Zope« eine herausragende Rolle. Nat&uuml;rlich ist der Name AI vollkommen &uuml;berzogen, aber das Ganze soll schon ein tolles Expertensystem werden.Dies war schon lange ein Herzenswusch von mir und ich habe mich in der letzten Woche an die Arbeit gemacht. Bei meiner Suche nach einer geigneten Grundlage bin ich auf »AIML« gesto&szlig;en. Diese Syntax schien mir sehr gut geeignet f&uuml;r das Expertensystem. Also habe ich damit angefangen und das Modul pyaiml installiert .<p>
Die AIML-Syntax ist sehr einfach zu erlernen und man kann die Lerndateien leicht erweitern. Das schien mir besonders wichtig. Die Integration in CUON ist auch sehr gut gelungen:<p>

Der cuon-client sendet eine Anfrage an den Zope-Server, dieser leitet Sie weiter zum AI-Server, wartet auf die Antwort und wertet diese aus. Ist die Anwort ein CUON-Befehl ( z.B. CUON ARTICLES SEARCH ALL ) startet er die entsprechende Routine. Bei diesen Beispiel wird noch mindestens 1 Suchparameter erwartet ( z.B. Suchwort aus Artikelnummer oder Artikelbezeichnung). CUON startet die Suche, formatiert das Ergebnis und sendet es als Anwort zur&uuml;ck. Falls die Anwort kein CUON-Befehl ist, wird Sie einfach zur&uuml;ckgegeben.
<p>
Dank »Zope« ist ein vollst&auml;ndiger neuer Client f&uuml;r diese AI  sehr, sehr einfach zu programmieren. Hier die Python-Variante:<p>
<center>
<table summary="Listing" border="0" bgcolor="#000000" cellpadding="1" cellspacing="0"><tr><td>
<table summary="" border="0" bgcolor="#d6ebff" cellpadding="3" cellspacing="2"><tr><td>
<pre><small>
import xmlrpclib
# connection-Data
CUON_SERVER="http://84.244.7.139:9673/Cuon"
Username = 'cuon'
Password = 'test'
# connect to Server
Server = xmlrpclib.ServerProxy(CUON_SERVER)
# Authorized
sid = Server.src.Databases.py_createSessionID( Username, Password)

print sid
# Set Information for cuon
dicUser={'Name':Username,'SessionID':sid,'userType':'cuon'}

# start show
ok = True
while ok:
    q1 = raw_input('> ')
    if q1 == 'Ciao' or q1 == 'Ende':
        ok = False
    answer =  Server.src.AI.py_getAI(q1.decode('iso-8859-1').encode('utf-7'),dicUser)
    print answer.decode('utf-7').encode('iso-8859-1')
</small></pre>
</td></tr></table>
</td></tr></table>
</center>

<p>
Diese wenigen Zeilen in eine Datei kopiert und mit "python Datei" gestartet, erlauben unter hunderten folgende Abfragen:<p>
<center>
<table summary="Listing" border="0" bgcolor="#000000" cellpadding="1" cellspacing="0"><tr><td>
<table summary="" border="0" bgcolor="#d6ebff" cellpadding="3" cellspacing="2"><tr><td>
<pre><small>
&gt;</strong></font> Hallo
Hallo, sch&ouml;n dich zu sehen
&gt;</strong></font> suche mir artikel hex
7404             Hex Inverter
7405             Hex Inverter with Open Collector Outputs
7407             Hex Buffer/Driver with 39V Open Collector Outputs
&gt;</strong></font> finde f&uuml;r mich alle artikel, die trigger enthalten
7413             Dual Schmitt-Trigger 4-input NAND Gate
7414             Hex Schmitt-Trigger Inverter
&gt;</strong></font> kennst du goethe
Ja, besonders mag ich seinen "Faust". Den ersten Teil aber lieber als den zweiten.
</small></pre>
</td></tr></table>
</td></tr></table>
</center>
und so weiter !!!!<p>

Die meisten werden erkannt haben, das ich einfach einen chatterbot erweitert habe.
<p>
Testet es mal an und vielleicht habt Ihr ja mal Lust, diesen Client in einer anderen Programmiersprache zu realisieren und zu erweitern. Einen kleinen GTK-Client gibts es ebenfalls auf  <a href="http://www.cuon.org">www.cuon.org</a>.
<p>

Ich m&ouml;chte hier auch noch erl&auml;utern, warum ich dieses Modul programmiert habe. Zum ersten finde ich, das im Imformationszeitalter es immer wichtiger wird, das Informationen aufbereitet werden. Wer sich mal durch 22000 Suchergebnisse bei google durchgearbeitet hat, wird wissen, wovon ich rede. <p>
Dann die Situation im Alltag. Mann/Frau m&ouml;chte wissen, welche Lieferanten einen bestimmten Artikel liefern. Ich habe mir in den Firmen ein paar Programme angeschaut. Entweder konnte das Programm dies nicht beantworten oder aber die Leute mu&szlig;ten im Handbuch nachsehen unter welchem Modul Sie eine Anfrage in SQL-Syntax eingeben konnten. Das dies dann auf un&uuml;berbr&uuml;ckbare Schwierigkeiten stie&szlig; ( Der Sachbearbeiter  wu&szlig;te nichts von SQL -- und brauchte es meiner Meinung nach auch nicht !!! ) war nur logisch. <p>
Auch als schnelle Telefonauskunft ( Kunde fragt nach preisg&uuml;nstigsten Hex Inverter ) kann man nat&uuml;rlich die Artikelverwaltung aufrufen und alle Hex Inverter durchschauen und sich den g&uuml;nstigsten merken. Der Kunde hat dann wahrscheinlich schon aufgelegt, aber Mann/Frau hat sich bem&uuml;ht. Die AI wird das wesentlich schneller erledigen.
<p>
Ich m&ouml;chte, das die AI als einfache Schnittstelle zu den Daten dient. Meine Vision ( ich hab vielleicht ein paar zuviele davon ) ist es dann nat&uuml;rlich, die jetzige Tastatureingabe durch eine Spracheingabe zu erweitern.


<p><font size="+2"><a name="ToC7"><strong>8. Das Wichtigste </strong></a></font></p>
Es ist noch sehr, sehr viel zu tun. Jede Hilfe ist mir hoch willkommen und gerade »Nicht-Programmierer« k&ouml;nnen aktiv an der Gestaltung mitarbeiten. Die Erweiterung ist wirklich von jeden realisierbar, aber nat&uuml;rlich lehne ich die Hilfe von Programmierern, Datenbank-Experten und »Zope«-Kennern keinesfalls ab. Java-Programmierer k&ouml;nnten sich z.B. an der Erstellung eines Java-Clients f&uuml;rs Handy begeistern, »Zope«-Kenner ein Webinterface in »Zope« erstellen. 
Interessenten bitte melden bei <a href="mailto:jh@cyrus.de">J. Hamel</a>, oder meldet euch &uuml;ber <a href="http://developer.berlios.de/projects/cuon/">Berlios.de</a>. Dort ist das Projekt gehostet und &uuml;ber SVN erreichbar. Unter <a href="http://www.cuon.org">www.cuon.org</a> ist es auch m&ouml;glich, im Punkt Modulausbau einfach W&uuml;nsche zu Funktionen, zus&auml;tzliche Felder oder &auml;hnliches zu hinterlegen. Bitte beteiligt euch am Projekt.
 




<!-- License start -->
<p><font size="+2"><strong>Lizenz</strong></font></p>
<p><em>
Dieser Text unterliegt der
<a href="http://www.fsf.org/licenses/fdl.html">GNU Free Documentation
License (FDL)</a>. Freie Verbreitung in modifizierter oder unmodifizierter
Form ist erlaubt; Modifikationen müssen unmißverständlich gekennzeichnet sein
und ebenfalls unter der FDL vertrieben werden.
</em></p>
<!-- License stop -->


<hr noshade="noshade" width="100%" />
<address>Copyright (C) J&uuml;rgen Hamel
<br />
letzte Änderung 2006-01-27</address>
<br />


</body>
</html>
